Revit 2026 API

# SpaceActualLightingLoad Property

---

Get the Actual Lighting Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ActualLightingLoad { get; }
```
```vb
Public ReadOnly Property ActualLightingLoad As Double
	Get
```
```cpp
public:
property double ActualLightingLoad {
	double get ();
}
```
```fsharp
member ActualLightingLoad : float with get
```

#### Property Value

Double

This property is used to get the Actual Lighting Load of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace